#include <stdio.h>

void main(){
	
	/* 限定宽度 */
	
	//占位符宽度至少5位，不满5位空格补齐,输出内容默认是右对齐
	//输出为"  453"
	printf("%5d\n",453);
	//输出为"456543"
	printf("%5d\n",456543);
	
	//使输出内容左对齐,在 % 后添加 - 即可
	//输出为"453  xx"
	printf("%-5dxx\n",453);
	
	//小数默认精度为6位，不够6位时用0补齐，宽度计算时包含小数点
	//输出为" 123.120000"
	printf("%11f\n",123.12);
	
	//小数超出6位后，第七位小数四舍五入至第六位，同时舍弃第六位以后的小数
	//输出为" 123.123456"
	printf("%11f\n",123.12345645);
	//输出为" 123.123457"
	printf("%11f\n",123.12345655);
	//左对齐
	//输出为"123.123457 xx"
	printf("%-11fxx\n",123.12345655);
	
	/*限制小数精度*/
	//保留两位小数
	//输出为"123.35"
	printf("%.2f\n",123.345);
	
	//保留5位小数
	//输出为"123.34500"
	printf("%.5f\n",123.345);
	
	//限定宽度、限制小数精度 结合使用
	//输出为" 1.74"
	printf("%5.2f\n",1.737);
	
	/*总是显示正负号*/
	//输出为"+3.141593"
	printf("%+f\n",3.1415926);
	//输出为"3.141593"
	printf("%f\n",3.1415926);
	//输出为"-3.141593"
	printf("%+f\n",-3.1415926);
	//输出为"-3.141593"
	printf("%f\n",-3.1415926);
	//输出为"+5"
	printf("%+d\n",5);
	//输出为"5"
	printf("%d\n",5);
	//输出为"-5"
	printf("%+d\n",-5);
	//输出为"-5"
	printf("%d\n",-5);
	
	/*输出部分字符串*/
	//输出前5个字符
	//输出为"hello"
	printf("%.5s\n","hello world");
	
	/*使用*代替限定值位置，通过参数传入限定值*/
	//左对齐并且宽度至少为10位
	printf("%*dxx\n",-10,456543);
	//输出前三位字符
	printf("%.*s\n",3,"hello world");
	//宽度至少10位并且保留4位小数
	printf("%*.*f\n",10,4,123.12345655);
	
	
}